ningjw/LPC55S69/core0/board/pin_mux.h
/*! @name PIO0_24 (coord E12), PWR_OFF
  @{ */
#define BOARD_INITPINS_PWR_OFF_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_PWR_OFF_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_PWR_OFF_PIN 24U   /*!<@brief 0U pin index: 24 */
                                         /* @} */

/*! @name PIO1_26 (coord E13), BT_PWR_EN
  @{ */
#define BOARD_INITPINS_BT_PWR_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_BT_PWR_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_BT_PWR_PIN 26U   /*!<@brief 1U pin index: 26 */
                                        /* @} */

/*! @name PIO1_30 (coord F9), BT_STATUS
  @{ */
#define BOARD_INITPINS_BT_STATUS_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_BT_STATUS_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_BT_STATUS_PIN 30U   /*!<@brief 1U pin index: 30 */
                                           /* @} */

/*! @name PIO1_27 (coord E8), BT_MODE
  @{ */
#define BOARD_INITPINS_BT_MODE_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_BT_MODE_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_BT_MODE_PIN 27U   /*!<@brief 1U pin index: 27 */
                                         /* @} */

/*! @name PIO1_25 (coord B8), BT_RST
  @{ */
#define BOARD_INITPINS_BT_RST_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_BT_RST_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_BT_RST_PIN 25U   /*!<@brief 1U pin index: 25 */
                                        /* @} */

/*! @name PIO0_2 (coord B11), BT_TXD
  @{ */
#define BOARD_INITPINS_BT_TXD_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_BT_TXD_PIN 2U  /*!<@brief 0U pin index: 2 */
                                      /* @} */

/*! @name PIO0_3 (coord F8), BT_RXD
  @{ */
#define BOARD_INITPINS_BT_RXD_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_BT_RXD_PIN 3U  /*!<@brief 0U pin index: 3 */
                                      /* @} */

/*! @name PIO0_5 (coord A7), BT_RTS
  @{ */
#define BOARD_INITPINS_BT_RTS_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_BT_RTS_PIN 5U  /*!<@brief 0U pin index: 5 */
                                      /* @} */

/*! @name PIO0_4 (coord E7), BT_CTS
  @{ */
#define BOARD_INITPINS_BT_CTS_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_BT_CTS_PIN 4U  /*!<@brief 0U pin index: 4 */
                                      /* @} */

/*! @name PIO1_24 (coord F6), NB_PWR_EN
  @{ */
#define BOARD_INITPINS_NB_PWR_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_NB_PWR_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_NB_PWR_PIN 24U   /*!<@brief 1U pin index: 24 */
                                        /* @} */

/*! @name PIO1_31 (coord H6), NB_RELOAD
  @{ */
#define BOARD_INITPINS_NB_RELOAD_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_NB_RELOAD_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_NB_RELOAD_PIN 31U   /*!<@brief 1U pin index: 31 */
                                           /* @} */

/*! @name PIO1_29 (coord G8), NB_ST
  @{ */
#define BOARD_INITPINS_NB_ST_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_NB_ST_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_NB_ST_PIN 29U   /*!<@brief 1U pin index: 29 */
                                       /* @} */

/*! @name PIO1_28 (coord A8), NB_RST
  @{ */
#define BOARD_INITPINS_NB_RST_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_NB_RST_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_NB_RST_PIN 28U   /*!<@brief 1U pin index: 28 */
                                        /* @} */

/*! @name PIO0_27 (coord N2), NB_RXD
  @{ */
#define BOARD_INITPINS_NB_RXD_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_NB_RXD_PIN 27U /*!<@brief 0U pin index: 27 */
                                      /* @} */

/*! @name PIO0_26 (coord H12), NB_TXD
  @{ */
#define BOARD_INITPINS_NB_TXD_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_NB_TXD_PIN 26U /*!<@brief 0U pin index: 26 */
                                      /* @} */

/*! @name PIO1_16 (coord C7), BAT_CHG
  @{ */
#define BOARD_INITPINS_BAT_CHRG_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_BAT_CHRG_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_BAT_CHRG_PIN 16U   /*!<@brief 1U pin index: 16 */
                                          /* @} */

/*! @name PIO1_13 (coord B3), BAT_STD
  @{ */
#define BOARD_INITPINS_BAT_STDBY_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_BAT_STDBY_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_BAT_STDBY_PIN 13U   /*!<@brief 1U pin index: 13 */
                                           /* @} */

/*! @name PIO0_10 (coord F2), ADC_FORMAT
  @{ */
#define BOARD_INITPINS_ADC_FORMAT_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_ADC_FORMAT_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_ADC_FORMAT_PIN 10U   /*!<@brief 0U pin index: 10 */
                                            /* @} */

/*! @name PIO0_16 (coord J2), ADC_SYNC
  @{ */
#define BOARD_INITPINS_ADC_SYNC_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_ADC_SYNC_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_ADC_SYNC_PIN 16U   /*!<@brief 0U pin index: 16 */
                                          /* @} */

/*! @name PIO0_30 (coord E5), ADC_MISO
  @{ */
#define BOARD_INITPINS_ADC_MISO_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_ADC_MISO_PIN 30U /*!<@brief 0U pin index: 30 */
                                        /* @} */

/*! @name PIO0_7 (coord G5), ADC_MODE
  @{ */
#define BOARD_INITPINS_ADC_MODE_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_ADC_MODE_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_ADC_MODE_PIN 7U    /*!<@brief 0U pin index: 7 */
                                          /* @} */

