ningjw/LPC55S69/core0/board/pin_mux.h
/*! @name PIO0_28 (coord F13), ADC_SPI_SCK
  @{ */
#define BOARD_INITPINS_ADC_SCK_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_ADC_SCK_PIN 28U /*!<@brief 0U pin index: 28 */
                                       /* @} */

/*! @name PIO0_0 (coord L12), ADC_CLK
  @{ */
#define BOARD_INITPINS_ADC_CLK_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_ADC_CLK_PIN 0U  /*!<@brief 0U pin index: 0 */
                                       /* @} */

/*! @name PIO1_6 (coord H5), PWR_AL
  @{ */
#define BOARD_INITPINS_PWR_AL_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_PWR_AL_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_PWR_AL_PIN 6U    /*!<@brief 1U pin index: 6 */
                                        /* @} */

/*! @name PIO0_20 (coord B12), PWR_SCL
  @{ */
#define BOARD_INITPINS_PWR_SCL_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_PWR_SCL_PIN 20U /*!<@brief 0U pin index: 20 */
                                       /* @} */

/*! @name PIO1_21 (coord M7), PWR_SDA
  @{ */
#define BOARD_INITPINS_PWR_SDA_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_PWR_SDA_PIN 21U /*!<@brief 1U pin index: 21 */
                                       /* @} */

/*! @name PIO1_7 (coord J5), SENSOR_ST
  @{ */
#define BOARD_INITPINS_SENSOR_ST_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SENSOR_ST_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_SENSOR_ST_PIN 7U    /*!<@brief 1U pin index: 7 */
                                           /* @} */

/*! @name PIO1_1 (coord G11), TEMP_ALT
  @{ */
#define BOARD_INITPINS_TEMP_ALT_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_TEMP_ALT_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_TEMP_ALT_PIN 1U    /*!<@brief 1U pin index: 1 */
                                          /* @} */

/*! @name PIO0_14 (coord C13), TEMP_SCL
  @{ */
#define BOARD_INITPINS_TEMP_SCL_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_TEMP_SCL_PIN 14U /*!<@brief 0U pin index: 14 */
                                        /* @} */

/*! @name PIO0_13 (coord C12), TEMP_SDA
  @{ */
#define BOARD_INITPINS_TEMP_SDA_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_TEMP_SDA_PIN 13U /*!<@brief 0U pin index: 13 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
